In [ ]:
#pandas
import pandas as pd
#pandas is defines as an open source library that provides 
#high performannce data manipulation in python
#data analysis reqiures lot of processing such as restructuring ,
#cleaning,mergin,manipulator etc..we perform pandas to perform the above functionalities coz it is fast,simple than the other tools 
#pandas is built on Numpy ,numpy is requiredfor operating
#pandas

In [ ]:
#pandas
#pandas is built on numpy,numpy is required for operating pandas
import pandas as pd

In [ ]:
import numpy as np
labels=['a','b','c']
my_data=[10,20,30]
arr=np.array(my_data)
d={'a':100,'b':200,'c':300}
pd.Series(my_data)

In [2]:
import pandas as pd
pd.Series(my_data)

0    10
1    20
2    30
dtype: int64

In [3]:
type(pd.Series(my_data))

pandas.core.series.Series

In [4]:
pd.Series(data=[print,len,sum])

0    <built-in function print>
1      <built-in function len>
2      <built-in function sum>
dtype: object

In [7]:
ser1=pd.Series([1,2,3,4,5],['australia','india','newzealand','usa','uk'])
ser1

australia     1
india         2
newzealand    3
usa           4
uk            5
dtype: int64

In [8]:
ser1['india']

2

In [9]:
ser1[1:3]

india         2
newzealand    3
dtype: int64

In [17]:
df=pd.DataFrame(np.random.randn(5,4),['a','b','c','d','e'])

In [11]:
df

          0         1         2         3
a  1.314794  0.744151  0.927781 -1.834479
b -0.016380 -0.232984 -0.201421 -0.201334
c -0.739447 -1.385865  0.934508  0.468290
d  1.800870 -1.875814  0.666112 -1.266218
e  1.732644 -0.758148  0.571164  0.497744

In [12]:
d={'col':[1,2],'co12':[3,4],'co13':[5,6]}
d

{'col': [1, 2], 'co12': [3, 4], 'co13': [5, 6]}

In [13]:
df=pd.DataFrame(data=d)
df

   col  co12  co13
0    1     3     5
1    2     4     6

In [14]:
df=pd.DataFrame(d,['row1','row2'])
df

      col  co12  co13
row1    1     3     5
row2    2     4     6

In [18]:
df

          0         1         2         3
a -1.462043  1.635072  2.194328 -0.805734
b  0.745109  0.293267  0.099090 -0.356776
c  0.088130  1.765762  1.527496  1.447501
d -0.125797 -0.126875  1.914849 -0.870794
e -0.900229 -0.752164 -0.556024  1.118682

In [19]:
type(df)

pandas.core.frame.DataFrame

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, a to e
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       5 non-null      float64
 1   1       5 non-null      float64
 2   2       5 non-null      float64
 3   3       5 non-null      float64
dtypes: float64(4)
memory usage: 200.0+ bytes

In [21]:
df.values

array([[-1.46204263,  1.63507201,  2.1943281 , -0.8057342 ],
       [ 0.74510917,  0.29326731,  0.09908983, -0.35677613],
       [ 0.08812981,  1.76576218,  1.52749602,  1.44750053],
       [-0.12579712, -0.12687485,  1.91484864, -0.87079421],
       [-0.90022933, -0.75216432, -0.55602387,  1.11868211]])

In [22]:
df.axes

[Index(['a', 'b', 'c', 'd', 'e'], dtype='object'),
 RangeIndex(start=0, stop=4, step=1)]

In [23]:
df.size

20

In [24]:
df[0]

a   -1.462043
b    0.745109
c    0.088130
d   -0.125797
e   -0.900229
Name: 0, dtype: float64

In [25]:
df["new"]=df[0]

In [26]:
df

          0         1         2         3       new
a -1.462043  1.635072  2.194328 -0.805734 -1.462043
b  0.745109  0.293267  0.099090 -0.356776  0.745109
c  0.088130  1.765762  1.527496  1.447501  0.088130
d -0.125797 -0.126875  1.914849 -0.870794 -0.125797
e -0.900229 -0.752164 -0.556024  1.118682 -0.900229

In [ ]:
df.drop('new',axis=1,inplace=True)

In [27]:
df

          0         1         2         3       new
a -1.462043  1.635072  2.194328 -0.805734 -1.462043
b  0.745109  0.293267  0.099090 -0.356776  0.745109
c  0.088130  1.765762  1.527496  1.447501  0.088130
d -0.125797 -0.126875  1.914849 -0.870794 -0.125797
e -0.900229 -0.752164 -0.556024  1.118682 -0.900229

In [29]:
ser2=pd.Series([5,6,7,8],['usa','brazil','canada','uk'])
ser2

usa       5
brazil    6
canada    7
uk        8
dtype: int64

In [30]:
ser1+ser2

australia      NaN
brazil         NaN
canada         NaN
india          NaN
newzealand     NaN
uk            13.0
usa            9.0
dtype: float64

In [31]:
df.dtypes

0      float64
1      float64
2      float64
3      float64
new    float64
dtype: object

In [32]:
df.ndim

2

In [33]:
df.index
df

          0         1         2         3       new
a -1.462043  1.635072  2.194328 -0.805734 -1.462043
b  0.745109  0.293267  0.099090 -0.356776  0.745109
c  0.088130  1.765762  1.527496  1.447501  0.088130
d -0.125797 -0.126875  1.914849 -0.870794 -0.125797
e -0.900229 -0.752164 -0.556024  1.118682 -0.900229

In [34]:
df.columns
df

          0         1         2         3       new
a -1.462043  1.635072  2.194328 -0.805734 -1.462043
b  0.745109  0.293267  0.099090 -0.356776  0.745109
c  0.088130  1.765762  1.527496  1.447501  0.088130
d -0.125797 -0.126875  1.914849 -0.870794 -0.125797
e -0.900229 -0.752164 -0.556024  1.118682 -0.900229